Конфигурация/Documents/ПриходПроцентовПоКредитномуИнструменту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПриходПроцентовПоКредитномуИнструменту</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ПроцентыПоКредитнымИнструментам</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваВКредитныхИнструментах</xr:Item>
				<xr:Item>InformationRegister.НоминалыКредитныхИнструментов</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйИнструмент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КредитныеИнструменты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложеннаяОплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Comment>Дата начала интервала, за который начисляются проценты</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Comment>Дата окончания интервала, за который начисляются проценты</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реинвестирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастичныйПриходПроцентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ВидыКредитныхИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКредитныхИнструментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выданный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полученный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/СтрокаБанковскойВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СтрокаБанковскойВыписки</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцептовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоОрганизация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеестрПлатежейФизЛиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДанныеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ПриходПроцентовПоКредитномуИнструменту/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьЗначенияСвойств(Объект,
			РаботаСКредитнымиИнструментами.ПолучитьПериодНачисленияПроцентов(
				ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Ссылка, Дата, КредитныйИнструмент, Организация, СчетДоверительногоУправления")));		
	КонецЕсли;
	
	Элементы.ЧастичныйПриходПроцентов.ТолькоПросмотр = Не РаботаСПользователями.ЭтоПолноправныйПользователь();
	
   	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗаполнитьПодтверждениеОперацииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	Оповестить("БанковкиеВыписки.Обновить");
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") И ИсточникВыбора.ИмяФормы = "Документ.СтрокаБанковскойВыписки.Форма.БанковкиеВыписки" Тогда
		Если ИсточникВыбора.ИсточникВыбора = "СтрокаБанковскойВыписки" Тогда
			Объект.СтрокаБанковскойВыписки   = ВыбранноеЗначение;
			ЭтаФорма.СтрокаБанковскойВыписки = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
		КонецЕсли;
		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	Если Не Объект.Реинвестирование Тогда
		
		Если ЗначениеЗаполнено(Объект.КредитныйИнструмент) Тогда
		
			НовыйРасчетныйСчет = РаботаСКредитнымиИнструментами.ПолучитьРасчетныйСчетВозвратаДенежныхСредств(Объект.Дата, Объект.Организация, Объект.КредитныйИнструмент);
			
			Если НовыйРасчетныйСчет <> Объект.РасчетныйСчет Тогда
				Объект.РасчетныйСчет = НовыйРасчетныйСчет;	
			КонецЕсли;
				
		Конецесли;
	
		Если ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) И ЗначениеЗаполнено(Объект.РасчетныйСчет)
			И Не РаботаСИсполнителями.ЕстьИсполнитель("ИсполнителиПоДенежнымСредствамСобственные",
				ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, РасчетныйСчет")) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На дату [" + Объект.Дата + "] отсутствует расчетный счет [" + Объект.РасчетныйСчет + "] в исполнителях (собственных) счета ДУ [" + Объект.СчетДоверительногоУправления + "].",, "Объект.РасчетныйСчет");
			
			Объект.РасчетныйСчет = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеинвестированиеПриИзменении(Элемент)
				
	Если Не Объект.Реинвестирование И ЗначениеЗаполнено(Объект.КредитныйИнструмент) Тогда
	
		НовыйРасчетныйСчет = РаботаСКредитнымиИнструментами.ПолучитьРасчетныйСчетВозвратаДенежныхСредств(Объект.Дата, Объект.Организация, Объект.КредитныйИнструмент);
		
		Если НовыйРасчетныйСчет <> Объект.РасчетныйСчет Тогда
			Объект.РасчетныйСчет = НовыйРасчетныйСчет;	
		КонецЕсли;
			
	Конецесли;
			
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КредитныйИнструментПриИзменении(Элемент)
	
	ПериодНачисленияПроцентов = РаботаСКредитнымиИнструментами.ПолучитьПериодНачисленияПроцентов(
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Ссылка, Дата, КредитныйИнструмент, Организация, СчетДоверительногоУправления"));
	
	Если Не Объект.Реинвестирование И ЗначениеЗаполнено(Объект.КредитныйИнструмент) Тогда
		Объект.РасчетныйСчет = РаботаСКредитнымиИнструментами.ПолучитьРасчетныйСчетВозвратаДенежныхСредств(Объект.Дата, Объект.Организация, Объект.КредитныйИнструмент);
	Иначе
		Объект.РасчетныйСчет = Неопределено;	
	КонецЕсли;	
			
	Если Не ЗначениеЗаполнено(Объект.НачалоПериода) И Не ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		ЗаполнитьЗначенияСвойств(Объект, ПериодНачисленияПроцентов);
	
	ИначеЕсли Объект.НачалоПериода <> ПериодНачисленияПроцентов.НачалоПериода Тогда
		ТекстВопроса = "Заполнить начало периода начисления процентов датой " + Формат(ПериодНачисленияПроцентов.НачалоПериода, "ДФ=dd.MM.yyyy") + "?";
		
		Если ЗначениеЗаполнено(Объект.ОкончаниеПериода) Тогда
			ТекстВопроса = ТекстВопроса + " Дата окончания периода при этом будет очищена.";
		КонецЕсли;
		
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ЗаполнитьЗначенияСвойств(Объект, ПериодНачисленияПроцентов);
		КонецЕсли;
		
	КонецЕсли;
	
	ОпределитьВидимостьОтложеннойОплаты(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаБанковскойВыпискиНажатие(Элемент, СтандартнаяОбработка)
	
	ВидДвиженияДС = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Приход");
	
	Если ТипЗнч(Объект.КредитныйИнструмент) = Тип("СправочникСсылка.ДепозитныеВклады") Тогда
		РеквизитыКредитногоИнструмента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.КредитныйИнструмент, Новый Структура("Контрагент, РасчетныйСчетКонтрагента", "БанковскийСчет.ЮрФизЛицо", "БанковскийСчет"));
	ИначеЕсли ТипЗнч(Объект.КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
		
		ДанныеКредитногоИнструмента = РаботаСКредитнымиИнструментами.ПолучитьДанныеКредитногоИнструмента(Объект.КредитныйИнструмент, Объект.Дата);
		Если НЕ ЗначениеЗаполнено(ДанныеКредитногоИнструмента.Контрагент) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан контрагент в условиях займа", Объект.КредитныйИнструмент);
			Возврат;
		КонецЕсли;
		Если ДанныеКредитногоИнструмента.ЭтоЗаймПолученный Тогда
			ВидДвиженияДС = ПредопределенноеЗначение("Перечисление.ВидыДвижений.Расход");
		КонецЕсли;
		
		РеквизитыКредитногоИнструмента = Новый Структура("Контрагент, РасчетныйСчетКонтрагента", ДанныеКредитногоИнструмента.Контрагент, Объект.РасчетныйСчет);
	КонецЕсли;
	
	РаботаСБанковскимиВыпискамиКлиентСервер.ВыполнитьДействиеСоСтрокойБанковскойВыписки(
		Новый Структура("Период, Организация, РасчетныйСчет, ВидДвижения, Сумма, Контрагент",
			Объект.Дата,
			Объект.Организация,
			Объект.РасчетныйСчет,
			ВидДвиженияДС,
			Объект.Сумма,
			РеквизитыКредитногоИнструмента.Контрагент,
			РеквизитыКредитногоИнструмента.РасчетныйСчетКонтрагента),
		"СтрокаБанковскойВыписки",
		ЭтаФорма,
		СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед выбором расчетного счета необходимо указать счет доверительного управления.",, "Объект.СчетДоверительногоУправления");
		Объект.РасчетныйСчет = Неопределено;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) 
		И Не РаботаСИсполнителями.ЕстьИсполнитель("ИсполнителиПоДенежнымСредствамСобственные", 
			ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, РасчетныйСчет")) Тогда
				
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет [" + Объект.РасчетныйСчет + "] отсутствует в исполнителях (собственных) счета ДУ [" + Объект.СчетДоверительногоУправления + "].",, "Объект.РасчетныйСчет");	
		Объект.РасчетныйСчет = Неопределено;		
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
			
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));

	ЭтаФорма.СтрокаБанковскойВыписки = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ОпределитьВидимостьОтложеннойОплаты(ЭтаФорма);
	
	ОпределитьДоступностьБанковскойВыписки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы      = Форма.Элементы;
	
	ЭтоРеинвестирование = ДанныеОбъекта.Реинвестирование;
	ЭтоЗайм = ТипЗнч(ДанныеОбъекта.КредитныйИнструмент) = Тип("СправочникСсылка.Займы");
	
	Элементы.Реинвестирование.Видимость			= Не ЭтоЗайм;
	Элементы.ЧастичныйПриходПроцентов.Видимость	= Не ЭтоЗайм;
	Элементы.РасчетныйСчет.Доступность         	= Не РаботаСКредитнымиИнструментами.НеобходимоЗаполнениеЗначенияРасчетногоСчетаВозвратаДенежныхСредств(ДанныеОбъекта.Организация, ДанныеОбъекта.КредитныйИнструмент);
	Элементы.РасчетныйСчет.Видимость 		   	= Не ЭтоРеинвестирование;
	Элементы.СтрокаБанковскойВыписки.Видимость 	= Не ЭтоРеинвестирование;
	
	//удаление значений скрываемых полей
	Если Форма.Модифицированность Тогда
		
		ПутьКДаннымСкрываемыхПолей = Новый Структура();

		ПутьКДаннымСкрываемыхПолей.Вставить("РасчетныйСчет", "Объект.РасчетныйСчет");				
		ПутьКДаннымСкрываемыхПолей.Вставить("Реинвестирование", "Объект.Реинвестирование");				
		ПутьКДаннымСкрываемыхПолей.Вставить("ЧастичныйПриходПроцентов", "Объект.ЧастичныйПриходПроцентов");				
		ПутьКДаннымСкрываемыхПолей.Вставить("СтрокаБанковскойВыписки", РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок("СтрокаБанковскойВыписки, Объект.СтрокаБанковскойВыписки", ",", Истина, Истина));

		РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(Форма, ПутьКДаннымСкрываемыхПолей);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоВыданныйЗайм(КредитныйИнструмент)
	
	Возврат ТипЗнч(КредитныйИнструмент) = ТИП("СправочникСсылка.Займы") 
		И КредитныйИнструмент.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Выданный;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОпределитьВидимостьОтложеннойОплаты(Форма)
	
	Форма.Элементы.ГруппаОтложеннаяОплата.Видимость = Ложь;
	
	КредитныйИнструмент = Форма.Объект.КредитныйИнструмент;
	
	Если ЗначениеЗаполнено(КредитныйИнструмент) 
		И ТипЗнч(КредитныйИнструмент) = Тип("СправочникСсылка.Займы") Тогда
		
		Форма.Элементы.ГруппаОтложеннаяОплата.Видимость = ЭтоВыданныйЗайм(КредитныйИнструмент) И НЕ ЗначениеЗаполнено(Форма.Объект.СтрокаБанковскойВыписки);
	КонецЕсли;
	
Конецпроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЭтоВыданныйЗайм(Объект.КредитныйИнструмент) Тогда
		Объект.ОтложеннаяОплата = Ложь;
		Объект.ДатаОплаты = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОпределитьДоступностьБанковскойВыписки(Форма)
	Форма.Элементы.СтрокаБанковскойВыписки.Видимость = НЕ Форма.Объект.ОтложеннаяОплата;
КонецПроцедуры

&НаКлиенте
Процедура ОтложеннаяОплатаПриИзменении(Элемент)
	
	ОпределитьДоступностьБанковскойВыписки(ЭтаФорма);
	Если НЕ Объект.ОтложеннаяОплата Тогда
		Объект.ДатаОплаты = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
